run/3DmultiRegionReactiveBubble/baseMeshes/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    reactiveHydroBubbleInterTrackFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             0.5;

deltaT              5e-6;

writeControl        runTime;

writeInterval       5e-6;

cycleWrite          0;

writeFormat         ascii;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       8;

runTimeModifiable   yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1e-5;

minDeltaT       5e-7;

/*functions
(
    globalSelectivity
    {
        // Type of functionObject
        type globalSelectivity;

        reactants (B A);
        
        products  (P SP);

        region    refined;

        phiName   phiFine;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libuserUtilityFunctionObjects.so");
    }
);*/

// ************************************************************************* //

