run/3DmultiRegionReactiveBubble/baseMeshes/constant/faMesh/faceLabels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant/faMesh";
    object      faceLabels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


999
(
412974
412975
412976
412977
412978
412979
412980
412981
412982
412983
412984
412985
412986
412987
412988
412989
412990
412991
412992
412993
412994
412995
412996
412997
412998
412999
413000
413001
413002
413003
413004
413005
413006
413007
413008
413009
413010
413011
413012
413013
413014
413015
413016
413017
413018
413019
413020
413021
413022
413023
413024
413025
413026
413027
413028
413029
413030
413031
413032
413033
413034
413035
413036
413037
413038
413039
413040
413041
413042
413043
413044
413045
413046
413047
413048
413049
413050
413051
413052
413053
413054
413055
413056
413057
413058
413059
413060
413061
413062
413063
413064
413065
413066
413067
413068
413069
413070
413071
...
)


// ************************************************************************* //
