run/3DmultiRegionReactiveBubble/baseMeshes/constant/sorptionProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mixtureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cleanSurface no;

soluble yes;

bulkDiffusionCoeff	bulkDiffusionCoeff      [ 0  2 -1 0  0 0 0 ] 1.0e-9;

surfaceDiffusionCoeff	surfaceDiffusionCoeff	[ 0  2 -1 0  0 0 0 ] 1.0e-7;
