run/3DmultiRegionReactiveBubble/baseMeshes/0.org/Cdefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cdefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0.0;

boundaryField
{
    space
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }
    interfaceShadow
    {
        type            fixedGradient;
        gradient        uniform 0.0;
        value           $internalField;
    }
    interface
    {
        type            fixedGradient;
        gradient        uniform 0.0;
        value           $internalField;
    }
}

// ************************************************************************* //
