run/3DmultiRegionReactiveBubble/baseMeshes/0.org/CsVf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CsVf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    interfaceShadow
    {
        type            calculated;
        value           uniform 0;
    }
    interface
    {
        type            calculated;
        value           uniform 1e-06;
    }
    space
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
