run/3DmultiRegionReactiveBubble/baseMeshes/0.org/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       tetPointVectorField;
    location    "0";
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    space
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    interfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    interface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
