run/3DmultiRegionReactiveBubble/baseMeshes/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner      
        {                   

            preconditioner  GAMG;
            nVcycles        4;
            tolerance       1e-06;
            relTol          0;       
            smoother        DICGaussSeidel;      
            //number of smoothing steps before projection
            nSmoothingSteps 5;                           
            //sweeps to perform before moving to a coarser level. 
            nPreSweeps      1;                                    
            //sweeps to perform after coarser level corrections   
            nPostSweeps     2;                                    
            nFinestSweeps   2;                                  
            cacheAgglomeration true;                              
            nCellsInCoarsestLevel 16;
            agglomerator    faceAreaPair; 
            //-HM alternatives: algebraicPair; faceAreaPair;
            mergeLevels     1;                                    
        }
        tolerance        1e-07;
        relTol           0;   
        minIter          1;   
        maxIter          50;  
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    Ci
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
        minIter         2;

    }
}

PISO
{
    nOuterCorrectors            5; //6
    nCorrectors                 3; //2
    nNonOrthogonalCorrectors    1;

    pRefPoint (0.0001 0.0001 0.0);
    pRefValue 0;
}

ddtPhiCorr true;

// ************************************************************************* //
