run/3DmultiRegionReactiveBubble/baseMeshes/system/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Cs
    {
        solver          PBiCG;//BICCG;
        preconditioner  DILU;
        minIter         2;
        maxIter         2000;
        tolerance       1e-06;
        relTol          0;
    }
}

relaxationFactors
{}

// ************************************************************************* //
